var a = [
  [
  0,
  [
    ["构建意义；", ""],
    ["构建程序；", ""],
    ["构建原则；", ""],
    ["构建的具体指标", ""]
  ],
  "大学生品德评价指标体系一般包括（    ）。",
  "ACD",
  "mutiple",
  "大学心理学",
  "两个功能"
],
  [
    1,
    [
      ["构建意义；", ""],
      ["构建程序；", ""],
      ["构建原则；", ""],
      ["构建的具体指标", ""],
      ["构建", ""]
    ],
    "大学生品德评价指标体系一般包括（    ）。",
    "A",
    "single",
    "大学心理学",
    "两个功能"
  ],
  [
    2,
    [
      ["对", ""],
      ["错", ""],
    ],
    "大学生品德评价指标体系一般包括（    ）。",
    "A",
    "judge",
    "大学心理学",
    "两个功能"
  ],
  [
    3,
    [
      ["构建意义；", ""],
      ["构建程序；", ""],
      ["构建原则；", ""],
      ["构建的具体指标", ""]
    ],
    "大学生品德评价指标体系一般包括（    ）。",
    "ACD",
    "mutiple",
    "大学心理学",
    "两个功能"
  ],
  [
    4,
    [
      ["构建意义；", ""],
      ["构建程序；", ""],
      ["构建原则；", ""],
      ["构建的具体指标", ""],
      ["构建", ""]
    ],
    "大学生品德评价指标体系一般包括（    ）。",
    "A",
    "single",
    "大学心理学",
    "两个功能"
  ],
  [
    5,
    [
      ["对", ""],
      ["错", ""],
    ],
    "大学生品德评价指标体系一般包括（    ）。",
    "A",
    "judge",
    "大学心理学",
    "两个功能"
  ]
]

module.exports = {
  rows: a,
  cget:function(k){
    wx.getStorage({
      key: k,
      success: function(res) {
        return res.data;
      },
    })
  },
  cset:function(k,v)
  {
    wx.setStorage({
      key: k,
      data: value,
    })
  },
  chget:function(k,hk){
    var data = this.cget(k);

  }
}
